InformationRegisters/ДанныеПоискаФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПоискаФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресаЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЛичныеДанныеКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЛичныеДанныеКандидатов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСлужебное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеВБраке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостояниеВБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатовПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИООтсутствует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗнаниеЯзыков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Язык</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯзыкиНародовМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньЗнанияЯзыкаКандидата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтепениЗнанияЯзыкаКандидата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Образование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОбразования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчебноеЗаведение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факультет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специальность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Курсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеКурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчебноеЗаведение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяИнформация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УченыеСтепени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УченаяСтепень</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УченыеСтепени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрисужденияУченойСтепени</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОпытРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязанности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СфераДеятельностиКомпании</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПоискФизическихЛиц/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.РегистрыСведений.ДанныеПоискаФизическихЛиц, Истина);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ЗащитаПерсональныхДанных

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных.
Процедура ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных(ТаблицаСведений) Экспорт
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.ДанныеПоискаФизическихЛиц;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.АдресаЭлектроннойПочты.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.Телефоны.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "КонтактнаяИнформация";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗащитаПерсональныхДанных

// См. Справочники.ФизическиеЛица.ДополнитьМетаданныеИсключаемыеПриЗаменеСсылокНаДубли
Процедура ДополнитьМетаданныеИсключаемыеПриЗаменеСсылокНаДубли(ИсключаемыеМетаданные) Экспорт
	
	ИсключаемыеМетаданные.Добавить(Метаданные.РегистрыСведений.ДанныеПоискаФизическихЛиц.ПолноеИмя());
	
КонецПроцедуры

#КонецОбласти

#Область ПоискПохожихЛюдей

// Создает структуру параметров для поиска похожих людей.
// 
// Параметры:
//  ИсходныеПараметрыПоиска - Структура, Неопределено -
// 
// Возвращаемое значение:
//  Структура:
//   * Ссылка - СправочникСсылка.ФизическиеЛица, СправочникСсылка.ЛичныеДанныеКандидатов - 
//   * Фамилия - Строка
//   * Имя - Строка 
//   * Отчество - Строка 
//   * УточнениеНаименования - Строка
//   * Телефон - Строка 
//   * EMail - Строка 
//   * ФИОПолностью - Булево 
//   * ТочноеСовпадение - Булево 
//   * ОбязательноЗаполненноеФИО - Булево
//   * ИскатьСредиФизическихЛиц - Булево 
//   * ИсключаемыеФизическиеЛица - Массив из СправочникСсылка.ФизическиеЛица
//   * ИскатьВАрхиве - Булево
Функция ПараметрыПоискаПохожихЛюдей(ИсходныеПараметрыПоиска = Неопределено) Экспорт
	
	ПараметрыПоиска = СотрудникиКлиентСервер.ПараметрыПоискаПохожих();
	Если ЗначениеЗаполнено(ИсходныеПараметрыПоиска) Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, ИсходныеПараметрыПоиска);
	КонецЕсли;
	
	Если Не ПараметрыПоиска.Свойство("ИскатьСредиФизическихЛиц") Тогда
		ПараметрыПоиска.Вставить("ИскатьСредиФизическихЛиц", Истина);
	КонецЕсли;
	
	Если Не ПараметрыПоиска.Свойство("ИсключаемыеФизическиеЛица") Тогда
		ПараметрыПоиска.Вставить("ИсключаемыеФизическиеЛица", Новый Массив);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
		МодульПодборПерсонала.ДополнитьПараметрыПоискаПохожихЛюдей(ПараметрыПоиска);
	КонецЕсли;

	Возврат ПараметрыПоиска;
	
КонецФункции

// Создает структруру для хранения результата поиска похожих людей.
// 
// Возвращаемое значение:
//  Структура - Похожие люди:
//   * РезультатПоискаФизическихЛиц - см. СотрудникиФормы.НовыйРезультатПоискаПохожихФизическихЛиц
//   * РезультатПоискаКандидатов - см. ПодборПерсоналаФормы.НовыйРезультатПоискаПохожихКандидатов
//   * ЧеловекУникален - Булево - Истина, если не было найдено похожих людей ни среди физических лиц, ни среди личных
//     данных кандидатов.
//   * КоличествоПохожихЧеловек - Число - Количество найденных похожих людей. Физическое лицо и связанные с ним личные
//     данные кандидата считаются как один человек.
Функция НовыйРезультатПоискаПохожихЛюдей() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("РезультатПоискаФизическихЛиц", СотрудникиФормы.НовыйРезультатПоискаПохожихФизическихЛиц());
	Результат.Вставить("РезультатПоискаКандидатов", ПодборПерсоналаФормы.НовыйРезультатПоискаПохожихКандидатов());
	Результат.Вставить("ЧеловекУникален", Истина);
	Результат.Вставить("КоличествоПохожихЧеловек", 0);
	
	Возврат Результат;
	
КонецФункции

// Возвращает результат поиска похожих людей.
// Поиск выполняется среди физических лиц и/или личных данных кандидатов в зависимости от значений параметров поиска
// ИскатьСредиФизическихЛиц и ИскатьСредиКандидатов.
// Если похожий человек был найден среди физических лиц, то связанные с ним личные данные канидата исключаются из
// результатов поиска.
// 
// Параметры:
//  ПараметрыПоиска - см. ПараметрыПоискаПохожихЛюдей
// 
// Возвращаемое значение:
//  см. НовыйРезультатПоискаПохожихЛюдей
Функция ПохожиеЛюди(ПараметрыПоиска) Экспорт

	Результат = НовыйРезультатПоискаПохожихЛюдей();
	
	Если ПараметрыПоиска.ИскатьСредиФизическихЛиц Тогда
		Результат.РезультатПоискаФизическихЛиц = СотрудникиФормы.РезультатПоискаФизическихЛиц(ПараметрыПоиска);
		Результат.ЧеловекУникален = Результат.РезультатПоискаФизическихЛиц.ФизическоеЛицоУникально;
		Результат.КоличествоПохожихЧеловек = Результат.РезультатПоискаФизическихЛиц.ДанныеФизическихЛиц.Количество();
		Для каждого ДанныеФизическогоЛица Из Результат.РезультатПоискаФизическихЛиц.ДанныеФизическихЛиц Цикл
			ПараметрыПоиска.ИсключаемыеФизическиеЛица.Добавить(ДанныеФизическогоЛица.ФизическоеЛицо);
		КонецЦикла;
	КонецЕсли;
	
	Если ПараметрыПоиска.ИскатьСредиКандидатов Тогда
		Результат.РезультатПоискаКандидатов = ПодборПерсоналаФормы.РезультатПоискаПохожихКандидатов(ПараметрыПоиска);
		Результат.ЧеловекУникален = Результат.ЧеловекУникален И Результат.РезультатПоискаКандидатов.КандидатУникален;
		Результат.КоличествоПохожихЧеловек = Результат.КоличествоПохожихЧеловек
			+ Результат.РезультатПоискаКандидатов.ДанныеКандидатов.Количество();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив из имен полей, совпавших при поиске похожих людей.
// 
// Параметры:
//  РезультатПоиска - см. НовыйРезультатПоискаПохожихЛюдей
// 
// Возвращаемое значение:
//  Массив из Строка
Функция СовпадающиеДанные(РезультатПоиска) Экспорт
	
	СовпадающиеДанные = Новый Массив;
	
	Если РезультатПоиска.КоличествоПохожихЧеловек > 0 Тогда
		Для Каждого ДанныеКандидата Из РезультатПоиска.РезультатПоискаКандидатов.ДанныеКандидатов Цикл
			СовпадающиеДанныеКандидата = СтрРазделить(ДанныеКандидата.СовпадающиеДанные, ",");
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СовпадающиеДанные, СовпадающиеДанныеКандидата, Истина);
		КонецЦикла;
		Для Каждого ДанныеФизическогоЛица Из РезультатПоиска.РезультатПоискаФизическихЛиц.ДанныеФизическихЛиц Цикл
			СовпадающиеДанныеФизическогоЛица = СтрРазделить(ДанныеФизическогоЛица.СовпадающиеДанные, ",");
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СовпадающиеДанные, СовпадающиеДанныеФизическогоЛица, Истина);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СовпадающиеДанные;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПервоначальноеЗаполнениеИОбновлениеИБ

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//
// Параметры:
//  Обработчики - это таблица значений, возвращаемая функцией
//                НоваяТаблицаОбработчиковОбновления модуля ОбновлениеИнформационнойБазы.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия    = "1.0.0.0";
//  Обработчик.Процедура = "ОбновлениеИБ.ПерейтиНаВерсию_1_0_0_0";
// 
//  Все свойства обработчика см. в комментарии к функции
//  НоваяТаблицаОбработчиковОбновления в модуле ОбновлениеИнформационнойБазы.
//
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.14.81";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("44adb0ce-f589-43f9-9773-4f762a96ee23");
	Обработчик.Процедура = "РегистрыСведений.ДанныеПоискаФизическихЛиц.ЗаполнитьДанныеПоискаФизическихЛиц";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение данных поиска для физических лиц'");

КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

Процедура ДополнитьОписаниеПрофиля(ОписаниеПрофиля) Экспорт
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхПоискаФизическихЛиц");
	
КонецПроцедуры

#КонецОбласти

Процедура ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные) Экспорт
	
	// Метаданные.Справочники.ФизическиеЛица
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.Справочники.ФизическиеЛица;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ДанныеПоискаФизическихЛиц;
	
КонецПроцедуры

Процедура ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления) Экспорт
	
	Если ПараметрыОбновления = Неопределено Тогда
		ПараметрыОбновления = Новый Структура("ОбработкаЗавершена", Ложь);
	КонецЕсли;
	
	Пока Не ПараметрыОбновления.ОбработкаЗавершена Цикл
		РегистрыСведений.ДанныеПоискаФизическихЛиц.ЗаполнитьДанныеПоискаФизическихЛиц(ПараметрыОбновления);
	КонецЦикла;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("Справочники.ЛичныеДанныеКандидатов");
		МодульПодборПерсонала.ЗаполнитьДанныеПоискаКандидатов(ПараметрыОбновления);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДанныеПоискаФизическогоЛица(ФизическоеЛицо) Экспорт

	ТипыКонтактнойИнформации = Новый Массив;
	ТипыКонтактнойИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ТипыКонтактнойИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	ТаблицаКИ = КонтактнаяИнформацияБЗК.КонтактнаяИнформацияОбъектов(ФизическоеЛицо.Ссылка, ТипыКонтактнойИнформации);
	
	Контакты = КонтактыВФорматеПоиска(ТаблицаКИ);
	
	Если КонтактыИзменились(ФизическоеЛицо, Контакты) Тогда
		РегистрыСведений.ДанныеПоискаФизическихЛиц.ОбновитьДанныеПоискаФизическихЛиц(
			ФизическоеЛицо.Ссылка, Контакты.АдресаЭлектроннойПочты, Контакты.Телефоны);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПоиска(ФизическиеЛица, ПараметрыОбновления = Неопределено) Экспорт
	
	ТипыКонтактнойИнформации = Новый Массив;
	ТипыКонтактнойИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ТипыКонтактнойИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
		ФизическиеЛица, ТипыКонтактнойИнформации, , Ложь);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ТаблицаКИ, "Объект");
	
	ФизическиеЛицаКИ = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаКИ, "Объект", Истина);
	Для Каждого ФизическоеЛицоКИ Из ФизическиеЛицаКИ Цикл
		Контакты = КонтактыВФорматеПоиска(ТаблицаКИ.НайтиСтроки(Новый Структура("Объект", ФизическоеЛицоКИ)));
		
		Если Не ПустаяСтрока(Контакты.Телефоны) Или Не ПустаяСтрока(Контакты.АдресаЭлектроннойПочты) Тогда
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления,
				"РегистрСведений.ДанныеПоискаФизическихЛиц", "ФизическоеЛицо", ФизическоеЛицоКИ) Тогда
				Продолжить;
			КонецЕсли;
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(
				РегистрыСведений.ДанныеПоискаФизическихЛиц.ДанныеПоискаНаборЗаписей(ФизическоеЛицоКИ, Контакты.Телефоны,
					Контакты.АдресаЭлектроннойПочты), Истина);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает телефон в формате поиска.
// 
// Параметры:
//  Телефон - Строка
// 
// Возвращаемое значение:
//  Строка - Телефон в формате поиска
Функция ТелефонВФорматеПоиска(Телефон) Экспорт

	Если Не ЗначениеЗаполнено(Телефон) Тогда
		Возврат "";
	КонецЕсли;
	
	Результат = "";
	
	Для Инд = 1 По СтрДлина(Телефон) Цикл
		Символ = Сред(Телефон, Инд, 1);
		Если Символ = "," Тогда
			Символ = ", ";
		Иначе
			Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Символ) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если Символ = "7" Тогда
			Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Прав(Результат, 1)) Или Результат = "" Тогда
				Символ = "8";
			КонецЕсли;
		КонецЕсли;
		Результат = "" + Результат + Символ;
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// Удаляет из таблицы похожих людей строки с неполным совпадением по номеру телефона или адресу электроннной почты.
// 
// Параметры:
//  ТаблицаПохожих - ТаблицаЗначений:
//   * Приоритет - Число
//   * Телефоны - Строка
//   * АдресаЭлектроннойПочты - Строка
//  ПараметрыПоиска - см. ПоискФизическихЛиц.ПараметрыПоискаПохожихЛюдей
Процедура УдалитьСтрокиСНеполнымСовпадением(ТаблицаПохожих, ПараметрыПоиска) Экспорт
	
	КоличесвоСтрок = ТаблицаПохожих.Количество();
	Для Сч = 1 По КоличесвоСтрок Цикл
		СтрокаДанных = ТаблицаПохожих[КоличесвоСтрок - Сч];
		Если СтрокаДанных.Приоритет = 1 Тогда
			Телефоны = СтрРазделить(СтрокаДанных.Телефоны, ",");
			Если Телефоны.Найти(ТелефонВФорматеПоиска(ПараметрыПоиска.Телефон)) = Неопределено Тогда
				ТаблицаПохожих.Удалить(СтрокаДанных);
			КонецЕсли;
		ИначеЕсли СтрокаДанных.Приоритет = 2 Тогда
			АдресаЭлектроннойПочты = СтрРазделить(СтрокаДанных.АдресаЭлектроннойПочты, ",");
			Если АдресаЭлектроннойПочты.Найти(ПараметрыПоиска.Email) = Неопределено Тогда
				ТаблицаПохожих.Удалить(СтрокаДанных);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КонтактыИзменились(ФизическоеЛицо, Контакты)
	
	Если Не ФизическоеЛицо.ДополнительныеСвойства.Свойство("ПрежниеЗначения") Тогда
		Возврат Не ПустаяСтрока(Контакты.Телефоны) Или Не ПустаяСтрока(Контакты.АдресаЭлектроннойПочты);
	КонецЕсли;
	
	ТаблицаКИ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ФизическоеЛицо.ДополнительныеСвойства["ПрежниеЗначения"], "ТаблицаКИ");
	Если ТаблицаКИ = Неопределено Тогда
		Возврат Не ПустаяСтрока(Контакты.Телефоны) Или Не ПустаяСтрока(Контакты.АдресаЭлектроннойПочты);
	КонецЕсли;
	
	КонтактыПрежние = КонтактыВФорматеПоиска(ТаблицаКИ);
	Возврат КонтактыПрежние.Телефоны <> Контакты.Телефоны 
		Или КонтактыПрежние.АдресаЭлектроннойПочты <> Контакты.АдресаЭлектроннойПочты;
	
КонецФункции

Функция КонтактыВФорматеПоиска(ТаблицаКИ) Экспорт
	
	Контакты = Новый Структура();
	Контакты.Вставить("Телефоны", "");
	Контакты.Вставить("АдресаЭлектроннойПочты", "");
	
	Для Каждого СтрокаКИ Из ТаблицаКИ Цикл
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			ДобавитьКонтакт(Контакты.Телефоны, ТелефонВФорматеПоиска(СтрокаКИ.Представление));
		ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			ДобавитьКонтакт(Контакты.АдресаЭлектроннойПочты, СтрокаКИ.Представление);
		Иначе
			ОбщегоНазначенияКлиентСервер.Проверить(Истина, 
				НСтр("ru = 'Обнаружен недопустимый тип контактной информации в таблице контактов для поиска'"), 
				"ПоискФизическихЛиц.КонтактыВФорматеПоиска");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Контакты;
	
КонецФункции

Процедура ДобавитьКонтакт(Представление, Контакт)
	
	Если Не ПустаяСтрока(Представление) Тогда
		Представление = Представление + ", ";
	КонецЕсли;
	
	Представление = Представление + Контакт;
	
КонецПроцедуры

#КонецОбласти
